//
//  sz_Error.m
//  shizhong
//
//  Created by sundaoran on 15/12/27.
//  Copyright © 2015年 sundaoran. All rights reserved.
//

#import "sz_Error.h"

@implementation sz_Error


-(void)setErrorCode:(NSString *)errorCode
{
    NSDictionary *errorDict=@{@"100002":@"系统异常",
                              @"100003":@"参数错误",
                              @"100004":@"token错误",
                              @"100005":@"验证码过期",
                              @"100006":@"验证码错误",
                              @"200001":@"视频不存在",
                              @"310001":@"手机/密码错误",
                              @"320002":@"手机号或密码错误",
                              @"320003":@"会员禁止登陆",
                              @"310002":@"310002",
                              @"320004":@"设备已禁止登录",
                              @"420001":@"手机号已注册",
                              @"420002":@"账号未注册",
                              @"420003":@"手机验证码不正确",
                              @"420004":@"手机验证码超时",
                              @"420005":@"账号已注册",
                              @"430001":@"用户不存在",
                              @"430002":@"用户信息不存在",
                              @"400001":@"手机已绑定",
                              @"404":@"网络繁忙，稍后重试",
                              @"100001":@"成功",
                              @"600001":@"话题不存在",
                              @"500001":@"视频不存在",
                              @"500002":@"删除视频失败",
                              @"430003":@"用户信息不存在",
                              @"0":@"网络繁忙，稍后重试",
                              @"700002":@"你已申过请舞社",
                              @"800001":@"舞种不存在",
                              @"900001":@"",
                              };
    _errorCode=errorCode;
    _errorDescription=[errorDict objectForKey:errorCode];
}


@end
